config.el
;; (when (getenv "WAYLAND_DISPLAY")
;;   (setq wl-copy-p nil
;;         interprogram-cut-function (lambda (text)
;;                                     (setq-local process-connection-type 'pipe)
;;                                     (setq wl-copy-p (start-process "wl-copy" nil "wl-copy" "-f" "-n"))
;;                                     (process-send-string wl-copy-p text)
;;                                     (process-send-eof wl-copy-p))
;;         interprogram-paste-function (lambda ()
;;                                       (unless (and wl-copy-p (process-live-p wl-copy-p))
;;                                         (shell-command-to-string "wl-paste -n | tr -d '\r'")))))

(use-package dashboard
  :ensure t
  :config
  (dashboard-setup-startup-hook))

(setq dashboard-startup-banner  2)

(setq initial-buffer-choice (lambda () (get-buffer-create "*dashboard*")))

(setq dashboard-items '((recents  . 5)
                        (bookmarks . 5)
                        (projects . 5)
                        (agenda . 5)
                        (registers . 5)))

(setq dashboard-center-content t)

(setq doom-fallback-buffer "*dashboard*")

;;(beacon-mode 1)

(setq-default cache-long-scans nil)

(setq bookmark-default-file "~/.config/doom/bookmarks")

(map! :leader
      (:prefix ("b". "buffer")
       :desc "List bookmarks"                          "L" #'list-bookmarks
       :desc "Set bookmark"                            "m" #'bookmark-set
       :desc "Delete bookmark"                         "M" #'bookmark-set
       :desc "Save current bookmarks to bookmark file" "w" #'bookmark-save))

(global-auto-revert-mode 1)
(setq global-auto-revert-non-file-buffers t)

(evil-define-key 'normal ibuffer-mode-map
  (kbd "f c") 'ibuffer-filter-by-content
  (kbd "f d") 'ibuffer-filter-by-directory
  (kbd "f f") 'ibuffer-filter-by-filename
  (kbd "f m") 'ibuffer-filter-by-mode
  (kbd "f n") 'ibuffer-filter-by-name
  (kbd "f x") 'ibuffer-filter-disable
  (kbd "g h") 'ibuffer-do-kill-lines
  (kbd "g H") 'ibuffer-update)
