config.el

(defun prefer-horizontal-split ()
  (set-variable 'split-height-threshold nil t)
  (set-variable 'split-width-threshold 40 t)) ; make this as low as needed
(add-hook 'markdown-mode-hook 'prefer-horizontal-split)
(map! :leader
      :desc "Clone indirect buffer other window" "b c" #'clone-indirect-buffer-other-window)

;;(setq initial-buffer-choice "~/.config/doom/start.org")

;;(define-minor-mode start-mode
 ;; "Provide functions for custom start page."
 ;; :lighter " start"
 ;; :keymap (let ((map (make-sparse-keymap)))
          ;;(define-key map (kbd "M-z") 'eshell)
   ;;         (evil-define-key 'normal start-mode-map
     ;;         (kbd "1") '(lambda () (interactive) (find-file "~/.config/doom/config.org"))
      ;;        (kbd "2") '(lambda () (interactive) (find-file "~/.config/doom/init.el"))
       ;;       (kbd "3") '(lambda () (interactive) (find-file "~/.config/doom/packages.el"))
        ;;      (kbd "4") '(lambda () (interactive) (find-file "~/.config/doom/eshell/aliases"))
         ;;     (kbd "5") '(lambda () (interactive) (find-file "~/.config/doom/eshell/profile")))
         ;; map))

;;(add-hook 'start-mode-hook 'read-only-mode) ;; make start.org read-only; use 'SPC t r' to toggle off read-only.
;;(provide 'start-mode)

(map! :leader
      (:prefix ("w" . "window")
       :desc "Winner redo" "<right>" #'winner-redo
       :desc "Winner undo" "<left>"  #'winner-undo))

(use-package exec-path-from-shell
  :ensure
  :init (exec-path-from-shell-initialize))

(use-package dap-mode
  :ensure
  :config
  (dap-ui-mode)
  (dap-ui-controls-mode 1)
  (dap-auto-configure-mode t)

  (require 'dap-lldb)
  (require 'dap-codelldb)
  (require 'dap-gdb-lldb)
  ;; installs .extension/vscode
  (dap-gdb-lldb-setup)
  (dap-register-debug-template
   "Rust::LLDB Run Configuration"
   (list :type "lldb"
         :request "launch"
         :name "LLDB::Run"
         :MIMode: "lldb"
         :miDebuggerPath "rust-lldb"
         :environment []
         :program "${workspaceFolder}/target/debug/hello"
         :cwd "${workspaceFolder}"
         :dap-compilation "cargo build"
         :dap-compilation-dir "${workspaceFolder}"
         :target nil
         :cwd nil)))

  (with-eval-after-load 'dap-mode
    (setq dap-default-terminal-kind "integrated") ;; Make sure that terminal programs open a term for I/O in an Emacs buffer
    (dap-auto-configure-mode +1))

  (with-eval-after-load 'lsp-rust
    (require 'dap-cpptools))

  (with-eval-after-load 'dap-mode
    (setq dap-default-terminal-kind "integrated") ;; Make sure that terminal programs open a term for I/O in an Emacs buffer
    (dap-auto-configure-mode +1))
