config.el

(use-package git-gutter
  :hook (prog-mode . git-gutter-mode)
  :config
  (setq git-gutter:update-interval 0.02))

(use-package git-gutter-fringe
  :config
  (define-fringe-bitmap 'git-gutter-fr:added [224] nil nil '(center repeated))
  (define-fringe-bitmap 'git-gutter-fr:modified [224] nil nil '(center repeated))
  (define-fringe-bitmap 'git-gutter-fr:deleted [128 192 224 240] nil nil 'bottom))

(require 'elcord)
(elcord-mode)
(setq elcord-display-project-name t)
(setq elcord-display-line-numbers nil)

(advice-add #'doom-highlight-non-default-indentation-h :override #'ignore)

(map! :leader
      :desc "Display the current project, and *only* the current project" "s t" #'treemacs-display-current-project-exclusively
      :desc "Open treemacs and add the current project root to the workspace"  "s T" #'treemacs-add-and-display-current-project)

(defun efs/org-mode-visual-fill ()
  (setq visual-fill-column-width 150
        visual-fill-column-center-text t)
  (visual-fill-column-mode 1))

(use-package visual-fill-column
  :hook (org-mode . efs/org-mode-visual-fill))

;; Disable line numbers for some modes
(dolist (mode '(org-mode-hook
                term-mode-hook
                shell-mode-hook
                treemacs-mode-hook
                eshell-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 0))))

(defun line-space-increase ()
  (setq line-spacing 6))

(add-hook 'org-mode-hook 'line-space-increase)

(setq browse-url-browser-function 'browse-url-generic)
;;(setq browse-url-generic-program "firefox")
(setq browse-url-browser-function 'browse-url-default-macosx-browser)

(require 'treesit)

(setq treesit-language-source-alist
   '((bash "https://github.com/tree-sitter/tree-sitter-bash")
     (cmake "https://github.com/uyha/tree-sitter-cmake")
     (css "https://github.com/tree-sitter/tree-sitter-css")
     (elisp "https://github.com/Wilfred/tree-sitter-elisp")
     (go "https://github.com/tree-sitter/tree-sitter-go")
     (html "https://github.com/tree-sitter/tree-sitter-html")
     (javascript "https://github.com/tree-sitter/tree-sitter-javascript" "master" "src")
     (c "https://github.com/tree-sitter/tree-sitter-c")
     (cpp "https://github.com/tree-sitter/tree-sitter-cpp")
     (make "https://github.com/alemuller/tree-sitter-make")
     (markdown "https://github.com/ikatyang/tree-sitter-markdown")
     (python "https://github.com/tree-sitter/tree-sitter-python")
     (toml "https://github.com/tree-sitter/tree-sitter-toml")
     (rust "https://github.com/tree-sitter/tree-sitter-rust")
     (latex "https://github.com/latex-lsp/tree-sitter-latex")
     (tsx "https://github.com/tree-sitter/tree-sitter-typescript" "master" "tsx/src")
     (typescript "https://github.com/tree-sitter/tree-sitter-typescript" "master" "typescript/src")
     (yaml "https://github.com/ikatyang/tree-sitter-yaml")))

(add-hook 'cpp-hook #'c++-ts-mode)
(add-hook 'c-hook #'c-ts-mode)
(add-hook 'rustic-mode-hook 'rust-ts-mode)

(use-package rustic
:ensure t
:config
:hook ((rust-ts-mode lsp-rust-analyzer) .
         (lambda () (require 'rustic) (lsp))))

(use-package lsp-pyright
:ensure t
:config
:hook ((python-ts-mode python-mode) .
         (lambda () (require 'lsp-pyright) (lsp))))

(use-package treesit-auto
  :demand t
  :config
  (setq treesit-auto-install 'prompt)
  (global-treesit-auto-mode))

;; (setq major-mode-remap-alist
;;  '((cpp-mode . c++-ts-mode)
;;    (c++-mode . c++-ts-mode)
;;    (c-mode . c-ts-mode)))

(require 'fast-scroll)
;; If you would like to turn on/off other modes, like flycheck, add
;; your own hooks.
(add-hook 'fast-scroll-start-hook (lambda () (flycheck-mode -1)))
(add-hook 'fast-scroll-end-hook (lambda () (flycheck-mode 1)))
(add-hook 'fast-scroll-start-hook (lambda () (flyspell-mode -1)))
(add-hook 'fast-scroll-end-hook (lambda () (flyspell-mode 1)))
(add-hook 'fast-scroll-start-hook (lambda () (font-lock-mode -1)))
(add-hook 'fast-scroll-end-hook (lambda () (font-lock-mode 1)))
(fast-scroll-config)
(fast-scroll-mode 1)

(after! tex-mode
  (map-delete sp-pairs 'LaTeX-mode)
  (map-delete sp-pairs 'latex-mode)
  (map-delete sp-pairs 'tex-mode)
  (map-delete sp-pairs 'plain-tex-mode))

;; accept completion from copilot and fallback to company
(use-package! copilot
  :hook (prog-mode . copilot-mode)
  :bind (:map copilot-completion-map
              ("<tab>" . 'copilot-accept-completion)
              ("TAB" . 'copilot-accept-completion)
              ("C-TAB" . 'copilot-accept-completion-by-word)
              ("C-<tab>" . 'copilot-accept-completion-by-word)))

(use-package elpy
  :ensure t
  :init
  (elpy-enable))
